longnguyencbct/STM32LAB3/SOURCECODE/LAB3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_RED1_Pin GPIO_PIN_1
#define LED_RED1_GPIO_Port GPIOA
#define LED_YELLOW1_Pin GPIO_PIN_2
#define LED_YELLOW1_GPIO_Port GPIOA
#define LED_GREEN1_Pin GPIO_PIN_3
#define LED_GREEN1_GPIO_Port GPIOA
#define LED_RED2_Pin GPIO_PIN_4
#define LED_RED2_GPIO_Port GPIOA
#define LED_YELLOW2_Pin GPIO_PIN_5
#define LED_YELLOW2_GPIO_Port GPIOA
#define LED_GREEN2_Pin GPIO_PIN_6
#define LED_GREEN2_GPIO_Port GPIOA
#define EN0_7SEG0_Pin GPIO_PIN_7
#define EN0_7SEG0_GPIO_Port GPIOA
#define P_A1_Pin GPIO_PIN_0
#define P_A1_GPIO_Port GPIOB
#define P_B1_Pin GPIO_PIN_1
#define P_B1_GPIO_Port GPIOB
#define P_C1_Pin GPIO_PIN_2
#define P_C1_GPIO_Port GPIOB
#define P_D2_Pin GPIO_PIN_10
#define P_D2_GPIO_Port GPIOB
#define P_E2_Pin GPIO_PIN_11
#define P_E2_GPIO_Port GPIOB
#define P_F2_Pin GPIO_PIN_12
#define P_F2_GPIO_Port GPIOB
#define P_G2_Pin GPIO_PIN_13
#define P_G2_GPIO_Port GPIOB
#define EN1_7SEG0_Pin GPIO_PIN_8
#define EN1_7SEG0_GPIO_Port GPIOA
#define EN0_7SEG1_Pin GPIO_PIN_9
#define EN0_7SEG1_GPIO_Port GPIOA
#define EN1_7SEG1_Pin GPIO_PIN_10
#define EN1_7SEG1_GPIO_Port GPIOA
#define Button0_Pin GPIO_PIN_12
#define Button0_GPIO_Port GPIOA
#define Button1_Pin GPIO_PIN_13
#define Button1_GPIO_Port GPIOA
#define Button2_Pin GPIO_PIN_14
#define Button2_GPIO_Port GPIOA
#define P_D1_Pin GPIO_PIN_3
#define P_D1_GPIO_Port GPIOB
#define P_E1_Pin GPIO_PIN_4
#define P_E1_GPIO_Port GPIOB
#define P_F1_Pin GPIO_PIN_5
#define P_F1_GPIO_Port GPIOB
#define P_G1_Pin GPIO_PIN_6
#define P_G1_GPIO_Port GPIOB
#define P_A2_Pin GPIO_PIN_7
#define P_A2_GPIO_Port GPIOB
#define P_B2_Pin GPIO_PIN_8
#define P_B2_GPIO_Port GPIOB
#define P_C2_Pin GPIO_PIN_9
#define P_C2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
